{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felixreichel/Documents/UNI/WIWI_Bachelor/2023S/SE Bachelorarbeit/Git/Partial Replication Cieslak 2019 et. al./stata_fed_put/stata_fed_put.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Jun 2023, 00:27:26
{txt}
{com}. 
. // Load FOMC cycle dummies .csv
. import delimited "fomc_week_dummies_2010_2016.csv", clear
{res}{text}(12 vars, 1779 obs)

{com}. // Order master data by date
. sort date
{txt}
{com}. // save .dta
. save d:fomc_data, replace
{txt}file d:fomc_data.dta saved

{com}. 
. 
. // Load SP500 data .csv
. import delimited "sp500_df_2014_2016.csv", clear
{res}{text}(2 vars, 756 obs)

{com}. // Order data by date
. sort date
{txt}
{com}. // save .dta
. save d:sp500_data, replace
{txt}file d:sp500_data.dta saved

{com}. 
. // Load SP500 data .csv
. import delimited "us_returns_df_2010_2016.csv", clear
{res}{text}(6 vars, 1810 obs)

{com}. // Order data by date
. sort date
{txt}
{com}. // save .dta
. save d:us_returns_data, replace
{txt}file d:us_returns_data.dta saved

{com}. 
. merge date using d:fomc_data d:us_returns_data d:sp500_data
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. // Save new merged data .dta
. save d:fed_put_datamerged_data, replace
{txt}file d:fed_put_datamerged_data.dta saved

{com}. 
. // Generate date2
. gen date2 = date(date, "YMD")
{txt}
{com}. 
. // For 2014 to 2016
. drop if date2 <= 19723
{txt}(1,027 observations deleted)

{com}. 
. 
. lgraph mktrfavg5d fomc_d
{res}{txt}
{com}. 
. // MLR
. 
. drop if missing(w_t0)
{txt}(6 observations deleted)

{com}. 
. drop if missing(sp500)
{txt}(47 observations deleted)

{com}. 
. 
. reg mktrf w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(2, 747)       = {res}     0.45
{txt}       Model {c |} {res} .654892498         2  .327446249   {txt}Prob > F        ={res}    0.6407
{txt}    Residual {c |} {res} 549.153108       747  .735144723   {txt}R-squared       ={res}    0.0012
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0015
{txt}       Total {c |} {res} 549.808001       749  .734056076   {txt}Root MSE        =   {res} .85741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.082{col 26}{space 2}    0.089{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}   -0.093{col 67}{space 3}    0.258
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.036{col 26}{space 2}    0.069{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 54}{space 4}   -0.100{col 67}{space 3}    0.171
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.004{col 26}{space 2}    0.046{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}   -0.086{col 67}{space 3}    0.095
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg mktrfavg5d w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(2, 747)       = {res}     3.50
{txt}       Model {c |} {res} .955730951         2  .477865475   {txt}Prob > F        ={res}    0.0306
{txt}    Residual {c |} {res} 101.918996       747  .136437746   {txt}R-squared       ={res}    0.0093
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0066
{txt}       Total {c |} {res} 102.874727       749  .137349435   {txt}Root MSE        =   {res} .36937

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  mktrfavg5d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.021{col 26}{space 2}    0.039{col 37}{space 1}    0.55{col 46}{space 3}0.586{col 54}{space 4}   -0.055{col 67}{space 3}    0.097
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.078{col 26}{space 2}    0.030{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4}    0.020{col 67}{space 3}    0.136
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.001{col 26}{space 2}    0.020{col 37}{space 1}    0.04{col 46}{space 3}0.965{col 54}{space 4}   -0.038{col 67}{space 3}    0.040
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. reg mktrf w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(2, 747)       = {res}     0.45
{txt}       Model {c |} {res} .654892498         2  .327446249   {txt}Prob > F        ={res}    0.6407
{txt}    Residual {c |} {res} 549.153108       747  .735144723   {txt}R-squared       ={res}    0.0012
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0015
{txt}       Total {c |} {res} 549.808001       749  .734056076   {txt}Root MSE        =   {res} .85741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.082{col 26}{space 2}    0.089{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}   -0.093{col 67}{space 3}    0.258
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.036{col 26}{space 2}    0.069{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 54}{space 4}   -0.100{col 67}{space 3}    0.171
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.004{col 26}{space 2}    0.046{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}   -0.086{col 67}{space 3}    0.095
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg mktrfavg5d w_t1 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(2, 747)       = {res}     3.79
{txt}       Model {c |} {res} 1.03474804         2  .517374021   {txt}Prob > F        ={res}    0.0229
{txt}    Residual {c |} {res} 101.839979       747  .136331967   {txt}R-squared       ={res}    0.0101
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0074
{txt}       Total {c |} {res} 102.874727       749  .137349435   {txt}Root MSE        =   {res} .36923

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  mktrfavg5d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t1 {c |}{col 14}{res}{space 2}    0.036{col 26}{space 2}    0.039{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}   -0.040{col 67}{space 3}    0.113
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.082{col 26}{space 2}    0.030{col 37}{space 1}    2.75{col 46}{space 3}0.006{col 54}{space 4}    0.023{col 67}{space 3}    0.140
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   -0.003{col 26}{space 2}    0.020{col 37}{space 1}   -0.15{col 46}{space 3}0.881{col 54}{space 4}   -0.042{col 67}{space 3}    0.036
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. reg mktrf w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(2, 747)       = {res}     0.45
{txt}       Model {c |} {res} .654892498         2  .327446249   {txt}Prob > F        ={res}    0.6407
{txt}    Residual {c |} {res} 549.153108       747  .735144723   {txt}R-squared       ={res}    0.0012
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0015
{txt}       Total {c |} {res} 549.808001       749  .734056076   {txt}Root MSE        =   {res} .85741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.082{col 26}{space 2}    0.089{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}   -0.093{col 67}{space 3}    0.258
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.036{col 26}{space 2}    0.069{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 54}{space 4}   -0.100{col 67}{space 3}    0.171
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.004{col 26}{space 2}    0.046{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}   -0.086{col 67}{space 3}    0.095
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg mktrfavg5d w_t1 w_t3 w_t5

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(3, 746)       = {res}     2.34
{txt}       Model {c |} {res} .957723826         3  .319241275   {txt}Prob > F        ={res}    0.0725
{txt}    Residual {c |} {res} 101.917003       746  .136617967   {txt}R-squared       ={res}    0.0093
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0053
{txt}       Total {c |} {res} 102.874727       749  .137349435   {txt}Root MSE        =   {res} .36962

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  mktrfavg5d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t1 {c |}{col 14}{res}{space 2}   -0.028{col 26}{space 2}    0.038{col 37}{space 1}   -0.73{col 46}{space 3}0.468{col 54}{space 4}   -0.103{col 67}{space 3}    0.047
{txt}{space 8}w_t3 {c |}{col 14}{res}{space 2}   -0.059{col 26}{space 2}    0.039{col 37}{space 1}   -1.52{col 46}{space 3}0.128{col 54}{space 4}   -0.136{col 67}{space 3}    0.017
{txt}{space 8}w_t5 {c |}{col 14}{res}{space 2}   -0.098{col 26}{space 2}    0.040{col 37}{space 1}   -2.45{col 46}{space 3}0.015{col 54}{space 4}   -0.176{col 67}{space 3}   -0.019
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.061{col 26}{space 2}    0.018{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4}    0.025{col 67}{space 3}    0.097
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. reg mktrf w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(2, 747)       = {res}     0.45
{txt}       Model {c |} {res} .654892498         2  .327446249   {txt}Prob > F        ={res}    0.6407
{txt}    Residual {c |} {res} 549.153108       747  .735144723   {txt}R-squared       ={res}    0.0012
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0015
{txt}       Total {c |} {res} 549.808001       749  .734056076   {txt}Root MSE        =   {res} .85741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.082{col 26}{space 2}    0.089{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}   -0.093{col 67}{space 3}    0.258
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.036{col 26}{space 2}    0.069{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 54}{space 4}   -0.100{col 67}{space 3}    0.171
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.004{col 26}{space 2}    0.046{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}   -0.086{col 67}{space 3}    0.095
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg mktrfavg5d w_t1 w_t2 w_t3 w_t4 w_t5 w_t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(6, 743)       = {res}     2.09
{txt}       Model {c |} {res} 1.70906236         6  .284843726   {txt}Prob > F        ={res}    0.0521
{txt}    Residual {c |} {res} 101.165665       743  .136158364   {txt}R-squared       ={res}    0.0166
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0087
{txt}       Total {c |} {res} 102.874727       749  .137349435   {txt}Root MSE        =   {res}   .369

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  mktrfavg5d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t1 {c |}{col 14}{res}{space 2}    0.012{col 26}{space 2}    0.047{col 37}{space 1}    0.25{col 46}{space 3}0.807{col 54}{space 4}   -0.081{col 67}{space 3}    0.104
{txt}{space 8}w_t2 {c |}{col 14}{res}{space 2}    0.037{col 26}{space 2}    0.048{col 37}{space 1}    0.77{col 46}{space 3}0.439{col 54}{space 4}   -0.057{col 67}{space 3}    0.130
{txt}{space 8}w_t3 {c |}{col 14}{res}{space 2}   -0.020{col 26}{space 2}    0.048{col 37}{space 1}   -0.42{col 46}{space 3}0.672{col 54}{space 4}   -0.114{col 67}{space 3}    0.073
{txt}{space 8}w_t4 {c |}{col 14}{res}{space 2}    0.103{col 26}{space 2}    0.048{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4}    0.009{col 67}{space 3}    0.196
{txt}{space 8}w_t5 {c |}{col 14}{res}{space 2}   -0.058{col 26}{space 2}    0.048{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}   -0.153{col 67}{space 3}    0.037
{txt}{space 8}w_t6 {c |}{col 14}{res}{space 2}   -0.005{col 26}{space 2}    0.063{col 37}{space 1}   -0.08{col 46}{space 3}0.937{col 54}{space 4}   -0.128{col 67}{space 3}    0.118
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.022{col 26}{space 2}    0.033{col 37}{space 1}    0.66{col 46}{space 3}0.507{col 54}{space 4}   -0.043{col 67}{space 3}    0.087
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. reg mktrf w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(2, 747)       = {res}     0.45
{txt}       Model {c |} {res} .654892498         2  .327446249   {txt}Prob > F        ={res}    0.6407
{txt}    Residual {c |} {res} 549.153108       747  .735144723   {txt}R-squared       ={res}    0.0012
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0015
{txt}       Total {c |} {res} 549.808001       749  .734056076   {txt}Root MSE        =   {res} .85741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.082{col 26}{space 2}    0.089{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}   -0.093{col 67}{space 3}    0.258
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.036{col 26}{space 2}    0.069{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 54}{space 4}   -0.100{col 67}{space 3}    0.171
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.004{col 26}{space 2}    0.046{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}   -0.086{col 67}{space 3}    0.095
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg mktrf w_t1 w_t2 w_t3 w_t4 w_t5 w_t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(6, 743)       = {res}     1.13
{txt}       Model {c |} {res} 4.98261563         6  .830435939   {txt}Prob > F        ={res}    0.3415
{txt}    Residual {c |} {res} 544.825385       743  .733277773   {txt}R-squared       ={res}    0.0091
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0011
{txt}       Total {c |} {res} 549.808001       749  .734056076   {txt}Root MSE        =   {res} .85632

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t1 {c |}{col 14}{res}{space 2}   -0.120{col 26}{space 2}    0.109{col 37}{space 1}   -1.10{col 46}{space 3}0.271{col 54}{space 4}   -0.334{col 67}{space 3}    0.094
{txt}{space 8}w_t2 {c |}{col 14}{res}{space 2}   -0.002{col 26}{space 2}    0.110{col 37}{space 1}   -0.02{col 46}{space 3}0.985{col 54}{space 4}   -0.219{col 67}{space 3}    0.215
{txt}{space 8}w_t3 {c |}{col 14}{res}{space 2}   -0.124{col 26}{space 2}    0.111{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}   -0.341{col 67}{space 3}    0.093
{txt}{space 8}w_t4 {c |}{col 14}{res}{space 2}    0.006{col 26}{space 2}    0.111{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}   -0.211{col 67}{space 3}    0.223
{txt}{space 8}w_t5 {c |}{col 14}{res}{space 2}    0.004{col 26}{space 2}    0.112{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}   -0.216{col 67}{space 3}    0.225
{txt}{space 8}w_t6 {c |}{col 14}{res}{space 2}   -0.279{col 26}{space 2}    0.145{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}   -0.564{col 67}{space 3}    0.007
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.086{col 26}{space 2}    0.077{col 37}{space 1}    1.13{col 46}{space 3}0.260{col 54}{space 4}   -0.064{col 67}{space 3}    0.237
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. lgraph mktrfavg5d fomc_d
{res}{txt}
{com}. 
. lgraph rf fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. lgraph mktrfavg5d fomc_d
{res}{txt}
{com}. 
. lgraph smb fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. drop if date2 <= 19723
{txt}(0 observations deleted)

{com}. 
. 
. lgraph mktrfavg5d fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. lgraph mktrfavg5d fomc_d
{res}{txt}
{com}. 
. 
. lgraph mktrfavg5d w_t2t4t6
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. drop if missing(sp500)
{txt}(0 observations deleted)

{com}. 
. reg mktrfavg5d w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(1, 748)       = {res}     6.71
{txt}       Model {c |} {res} .915115435         1  .915115435   {txt}Prob > F        ={res}    0.0098
{txt}    Residual {c |} {res} 101.959612       748  .136309641   {txt}R-squared       ={res}    0.0089
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0076
{txt}       Total {c |} {res} 102.874727       749  .137349435   {txt}Root MSE        =   {res}  .3692

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  mktrfavg5d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.072{col 26}{space 2}    0.028{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4}    0.018{col 67}{space 3}    0.127
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.006{col 26}{space 2}    0.017{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}   -0.027{col 67}{space 3}    0.040
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. drop if missing(sp500)
{txt}(0 observations deleted)

{com}. 
. 
. reg mktrfavg5d w_t0

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(1, 748)       = {res}     0.14
{txt}       Model {c |} {res} .019612739         1  .019612739   {txt}Prob > F        ={res}    0.7058
{txt}    Residual {c |} {res} 102.855114       748  .137506837   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 102.874727       749  .137349435   {txt}Root MSE        =   {res} .37082

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  mktrfavg5d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}   -0.014{col 26}{space 2}    0.036{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}   -0.085{col 67}{space 3}    0.058
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.036{col 26}{space 2}    0.015{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4}    0.007{col 67}{space 3}    0.065
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. drop if missing(sp500)
{txt}(0 observations deleted)

{com}. 
. 
. reg mktrfavg5d w_t1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(1, 748)       = {res}     0.00
{txt}       Model {c |} {res} 7.3800e-07         1  7.3800e-07   {txt}Prob > F        ={res}    0.9982
{txt}    Residual {c |} {res} 102.874726       748  .137533057   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0013
{txt}       Total {c |} {res} 102.874727       749  .137349435   {txt}Root MSE        =   {res} .37085

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  mktrfavg5d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t1 {c |}{col 14}{res}{space 2}    0.000{col 26}{space 2}    0.037{col 37}{space 1}    0.00{col 46}{space 3}0.998{col 54}{space 4}   -0.072{col 67}{space 3}    0.072
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.033{col 26}{space 2}    0.015{col 37}{space 1}    2.25{col 46}{space 3}0.025{col 54}{space 4}    0.004{col 67}{space 3}    0.062
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. reg mktrfavg5d w_t0

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(1, 748)       = {res}     0.14
{txt}       Model {c |} {res} .019612739         1  .019612739   {txt}Prob > F        ={res}    0.7058
{txt}    Residual {c |} {res} 102.855114       748  .137506837   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 102.874727       749  .137349435   {txt}Root MSE        =   {res} .37082

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  mktrfavg5d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}   -0.014{col 26}{space 2}    0.036{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}   -0.085{col 67}{space 3}    0.058
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.036{col 26}{space 2}    0.015{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4}    0.007{col 67}{space 3}    0.065
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg mktrfavg5d w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(1, 748)       = {res}     6.71
{txt}       Model {c |} {res} .915115435         1  .915115435   {txt}Prob > F        ={res}    0.0098
{txt}    Residual {c |} {res} 101.959612       748  .136309641   {txt}R-squared       ={res}    0.0089
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0076
{txt}       Total {c |} {res} 102.874727       749  .137349435   {txt}Root MSE        =   {res}  .3692

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  mktrfavg5d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.072{col 26}{space 2}    0.028{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4}    0.018{col 67}{space 3}    0.127
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.006{col 26}{space 2}    0.017{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}   -0.027{col 67}{space 3}    0.040
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. drop if missing(sp500)
{txt}(0 observations deleted)

{com}. 
. 
. 
. reg mktrf w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(1, 748)       = {res}     0.05
{txt}       Model {c |} {res} .034299901         1  .034299901   {txt}Prob > F        ={res}    0.8290
{txt}    Residual {c |} {res} 549.773701       748  .734991579   {txt}R-squared       ={res}    0.0001
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0013
{txt}       Total {c |} {res} 549.808001       749  .734056076   {txt}Root MSE        =   {res} .85732

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.014{col 26}{space 2}    0.065{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}   -0.113{col 67}{space 3}    0.141
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.026{col 26}{space 2}    0.040{col 37}{space 1}    0.66{col 46}{space 3}0.510{col 54}{space 4}   -0.052{col 67}{space 3}    0.104
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. drop if missing(sp500)
{txt}(0 observations deleted)

{com}. 
. 
. 
. reg mktrf w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       750
{txt}{hline 13}{c +}{hline 34}   F(2, 747)       = {res}     0.45
{txt}       Model {c |} {res} .654892498         2  .327446249   {txt}Prob > F        ={res}    0.6407
{txt}    Residual {c |} {res} 549.153108       747  .735144723   {txt}R-squared       ={res}    0.0012
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0015
{txt}       Total {c |} {res} 549.808001       749  .734056076   {txt}Root MSE        =   {res} .85741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.082{col 26}{space 2}    0.089{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}   -0.093{col 67}{space 3}    0.258
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.036{col 26}{space 2}    0.069{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 54}{space 4}   -0.100{col 67}{space 3}    0.171
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.004{col 26}{space 2}    0.046{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}   -0.086{col 67}{space 3}    0.095
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. drop if date2 <= 19723
{txt}(0 observations deleted)

{com}. 
. 
. lgraph mktrfavg5d fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. 