{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felixreichel/Documents/UNI/WIWI_Bachelor/2023S/SE Bachelorarbeit/Git/Partial Replication Cieslak 2019 et. al./stata_fed_put/stata_fed_put.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Jun 2023, 00:23:17
{txt}
{com}. 
. // Load FOMC cycle dummies .csv
. import delimited "fomc_week_dummies_2014_2016.csv", clear
{res}{text}(16 vars, 1050 obs)

{com}. // Order master data by date
. sort date
{txt}
{com}. // save .dta
. save d:fomc_data, replace
{txt}file d:fomc_data.dta saved

{com}. 
. // Load SP500 data .csv
. import delimited "sp500_df_2014_2016.csv", clear
{res}{text}(9 vars, 727 obs)

{com}. // Order data by date
. sort date
{txt}
{com}. // save .dta
. save d:sp500_data, replace
{txt}file d:sp500_data.dta saved

{com}. 
. // Load US SSR data .csv
. // import delimited "data/us_ssr_df.csv", clear
. // Order data by date
. // sort date
. // save .dta
. // save d:us_ssr_data, replace
. 
. // Merge 1:1 Using date
. // merge date using d:fomc_data d:sp500_data d:us_ssr_data
. merge date using d:fomc_data d:sp500_data
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. // Save new merged data .dta
. save d:fed_put_datamerged_data, replace
{txt}file d:fed_put_datamerged_data.dta saved

{com}. 
. // Generate date2
. gen date2 = date(date, "YMD")
{txt}
{com}. 
. // drop last 6 rows and first 6 rows
. drop if date2 >= 20794
{txt}(8 observations deleted)

{com}. drop if date2 <= 19758
{txt}(8 observations deleted)

{com}. 
. // Drop rows with missing S&P500 values (holidays, weekends)
. drop if missing(sp500_d1)
{txt}(320 observations deleted)

{com}. 
. 
. // drop if missing(w_t0)
. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD45872.000000"
{txt}
{com}. // i.w_t4 + i.w_t5 = sat+son.
. 
. reg sp500_5day_fw_diff date2 w_t0_e w_t1_e w_t2_e w_t3_e w_t6_e w_t0_o w_t1_o w_t2_o w_t3_o w_t6_o 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       715
{txt}{hline 13}{c +}{hline 34}   F(11, 703)      = {res}     1.48
{txt}       Model {c |} {res} 9495.79658        11  863.254235   {txt}Prob > F        ={res}    0.1358
{txt}    Residual {c |} {res} 411392.052       703  585.194953   {txt}R-squared       ={res}    0.0226
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0073
{txt}       Total {c |} {res} 420887.849       714   589.47878   {txt}Root MSE        =   {res} 24.191

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sp500_5day~f{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}date2 {c |}{col 14}{res}{space 2}    0.001{col 26}{space 2}    0.003{col 37}{space 1}    0.35{col 46}{space 3}0.724{col 54}{space 4}   -0.005{col 67}{space 3}    0.007
{txt}{space 6}w_t0_e {c |}{col 14}{res}{space 2}   -1.898{col 26}{space 2}   10.248{col 37}{space 1}   -0.19{col 46}{space 3}0.853{col 54}{space 4}  -22.019{col 67}{space 3}   18.223
{txt}{space 6}w_t1_e {c |}{col 14}{res}{space 2}   -6.976{col 26}{space 2}   10.248{col 37}{space 1}   -0.68{col 46}{space 3}0.496{col 54}{space 4}  -27.097{col 67}{space 3}   13.145
{txt}{space 6}w_t2_e {c |}{col 14}{res}{space 2}   -6.077{col 26}{space 2}   10.262{col 37}{space 1}   -0.59{col 46}{space 3}0.554{col 54}{space 4}  -26.225{col 67}{space 3}   14.071
{txt}{space 6}w_t3_e {c |}{col 14}{res}{space 2}  -10.473{col 26}{space 2}   10.288{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 54}{space 4}  -30.673{col 67}{space 3}    9.726
{txt}{space 6}w_t6_e {c |}{col 14}{res}{space 2}   -1.632{col 26}{space 2}   10.288{col 37}{space 1}   -0.16{col 46}{space 3}0.874{col 54}{space 4}  -21.832{col 67}{space 3}   18.567
{txt}{space 6}w_t0_o {c |}{col 14}{res}{space 2}   -7.430{col 26}{space 2}   10.300{col 37}{space 1}   -0.72{col 46}{space 3}0.471{col 54}{space 4}  -27.652{col 67}{space 3}   12.791
{txt}{space 6}w_t1_o {c |}{col 14}{res}{space 2}   -2.420{col 26}{space 2}   10.300{col 37}{space 1}   -0.23{col 46}{space 3}0.814{col 54}{space 4}  -22.643{col 67}{space 3}   17.803
{txt}{space 6}w_t2_o {c |}{col 14}{res}{space 2}   -3.534{col 26}{space 2}   10.313{col 37}{space 1}   -0.34{col 46}{space 3}0.732{col 54}{space 4}  -23.782{col 67}{space 3}   16.713
{txt}{space 6}w_t3_o {c |}{col 14}{res}{space 2}    1.249{col 26}{space 2}   10.333{col 37}{space 1}    0.12{col 46}{space 3}0.904{col 54}{space 4}  -19.039{col 67}{space 3}   21.537
{txt}{space 6}w_t6_o {c |}{col 14}{res}{space 2}  -10.142{col 26}{space 2}   10.332{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}  -30.428{col 67}{space 3}   10.143
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  -16.775{col 26}{space 2}   62.428{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4} -139.342{col 67}{space 3}  105.792
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD45872.000000"
{txt}
{com}. // i.w_t4 + i.w_t5 = sat+son.
. 
. reg sp500_5day_fw_diff w_t0_e w_t1_e w_t2_e w_t3_e w_t6_e w_t0_o w_t1_o w_t2_o w_t3_o w_t6_o 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       715
{txt}{hline 13}{c +}{hline 34}   F(10, 704)      = {res}     1.61
{txt}       Model {c |} {res} 9422.80626        10  942.280626   {txt}Prob > F        ={res}    0.0988
{txt}    Residual {c |} {res} 411465.043       704   584.46739   {txt}R-squared       ={res}    0.0224
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0085
{txt}       Total {c |} {res} 420887.849       714   589.47878   {txt}Root MSE        =   {res} 24.176

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sp500_5day~f{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}w_t0_e {c |}{col 14}{res}{space 2}   -2.003{col 26}{space 2}   10.238{col 37}{space 1}   -0.20{col 46}{space 3}0.845{col 54}{space 4}  -22.103{col 67}{space 3}   18.097
{txt}{space 6}w_t1_e {c |}{col 14}{res}{space 2}   -7.079{col 26}{space 2}   10.238{col 37}{space 1}   -0.69{col 46}{space 3}0.489{col 54}{space 4}  -27.179{col 67}{space 3}   13.021
{txt}{space 6}w_t2_e {c |}{col 14}{res}{space 2}   -6.176{col 26}{space 2}   10.252{col 37}{space 1}   -0.60{col 46}{space 3}0.547{col 54}{space 4}  -26.304{col 67}{space 3}   13.952
{txt}{space 6}w_t3_e {c |}{col 14}{res}{space 2}  -10.568{col 26}{space 2}   10.278{col 37}{space 1}   -1.03{col 46}{space 3}0.304{col 54}{space 4}  -30.748{col 67}{space 3}    9.612
{txt}{space 6}w_t6_e {c |}{col 14}{res}{space 2}   -1.730{col 26}{space 2}   10.278{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4}  -21.910{col 67}{space 3}   18.449
{txt}{space 6}w_t0_o {c |}{col 14}{res}{space 2}   -7.524{col 26}{space 2}   10.290{col 37}{space 1}   -0.73{col 46}{space 3}0.465{col 54}{space 4}  -27.726{col 67}{space 3}   12.679
{txt}{space 6}w_t1_o {c |}{col 14}{res}{space 2}   -2.521{col 26}{space 2}   10.290{col 37}{space 1}   -0.25{col 46}{space 3}0.807{col 54}{space 4}  -22.724{col 67}{space 3}   17.681
{txt}{space 6}w_t2_o {c |}{col 14}{res}{space 2}   -3.639{col 26}{space 2}   10.302{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4}  -23.866{col 67}{space 3}   16.587
{txt}{space 6}w_t3_o {c |}{col 14}{res}{space 2}    1.138{col 26}{space 2}   10.322{col 37}{space 1}    0.11{col 46}{space 3}0.912{col 54}{space 4}  -19.128{col 67}{space 3}   21.403
{txt}{space 6}w_t6_o {c |}{col 14}{res}{space 2}  -10.241{col 26}{space 2}   10.322{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}  -30.506{col 67}{space 3}   10.025
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    4.995{col 26}{space 2}    9.870{col 37}{space 1}    0.51{col 46}{space 3}0.613{col 54}{space 4}  -14.383{col 67}{space 3}   24.373
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. 