{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felixreichel/Documents/UNI/WIWI_Bachelor/2023S/SE Bachelorarbeit/Git/Partial Replication Cieslak 2019 et. al./stata_fed_put/stata_fed_put.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Jun 2023, 02:41:26
{txt}
{com}. 
. // Load FOMC cycle dummies .csv
. import delimited "fomc_week_dummies_2014_2016.csv", clear
{res}{text}(13 vars, 815 obs)

{com}. // Order master data by date
. sort date
{txt}
{com}. // save .dta
. save d:fomc_data, replace
{txt}file d:fomc_data.dta saved

{com}. 
. // Load SP500 data .csv
. import delimited "us_returns_df_2014_2016.csv", clear
{res}{text}(5 vars, 756 obs)

{com}. // Order data by date
. sort date
{txt}
{com}. // save .dta
. save d:us_returns_data, replace
{txt}file d:us_returns_data.dta saved

{com}. 
. merge date using d:fomc_data d:us_returns_data
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. // Save new merged data .dta
. save d:fed_put_datamerged_data, replace
{txt}file d:fed_put_datamerged_data.dta saved

{com}. 
. // Generate date2
. gen date2 = date(date, "YMD")
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg smb w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(2, 753)       = {res}     0.41
{txt}       Model {c |} {res} .231600772         2  .115800386   {txt}Prob > F        ={res}    0.6666
{txt}    Residual {c |} {res} 214.865431       753  .285345858   {txt}R-squared       ={res}    0.0011
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0016
{txt}       Total {c |} {res} 215.097032       755  .284896731   {txt}Root MSE        =   {res} .53418

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         smb{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}   -0.010{col 26}{space 2}    0.056{col 37}{space 1}   -0.18{col 46}{space 3}0.856{col 54}{space 4}   -0.119{col 67}{space 3}    0.099
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.033{col 26}{space 2}    0.043{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}   -0.051{col 67}{space 3}    0.117
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   -0.017{col 26}{space 2}    0.028{col 37}{space 1}   -0.58{col 46}{space 3}0.562{col 54}{space 4}   -0.072{col 67}{space 3}    0.039
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg hml w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(2, 753)       = {res}     0.51
{txt}       Model {c |} {res} .256177761         2  .128088881   {txt}Prob > F        ={res}    0.6013
{txt}    Residual {c |} {res} 189.514222       753  .251678913   {txt}R-squared       ={res}    0.0013
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0013
{txt}       Total {c |} {res} 189.770399       755  .251351522   {txt}Root MSE        =   {res} .50168

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         hml{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.014{col 26}{space 2}    0.052{col 37}{space 1}    0.28{col 46}{space 3}0.782{col 54}{space 4}   -0.088{col 67}{space 3}    0.117
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}   -0.033{col 26}{space 2}    0.040{col 37}{space 1}   -0.82{col 46}{space 3}0.414{col 54}{space 4}   -0.112{col 67}{space 3}    0.046
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.020{col 26}{space 2}    0.027{col 37}{space 1}    0.74{col 46}{space 3}0.460{col 54}{space 4}   -0.033{col 67}{space 3}    0.072
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. lgraph mktrf fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. lgraph mktrf fomc_d
{res}{txt}
{com}. lgraph sml fomc_d
{err}variable {bf}sml{sf} not found
{txt}{search r(111):r(111);}

end of do-file

{search r(111):r(111);}

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. lgraph mktrf fomc_d
{res}{txt}
{com}. lgraph smb fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. lgraph smb fomc_d
{res}{txt}
{com}. lgraph hml fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. lgraph mktrf w_even
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. lgraph mktrf w_t0 w_t2t4t6
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. lgraph mktrf w_t0 w_t1 w_t2 w_t3 w_t4 w_t5 w_t6 w_t7 w_tm1
{err}too many variables specified
{txt}{search r(103):r(103);}

end of do-file

{search r(103):r(103);}

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. lgraph mktrf w_t0 w_t1 w_t2 w_t3 w_t4 w_t5 w_t6 w_t7
{err}too many variables specified
{txt}{search r(103):r(103);}

end of do-file

{search r(103):r(103);}

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. lgraph mktrf w_t0 w_t1 w_t2 w_t3 w_t4 w_t5 w_t6
{err}too many variables specified
{txt}{search r(103):r(103);}

end of do-file

{search r(103):r(103);}

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. lgraph mktrf w_t0 w_t1 w_t2 w_t3 w_t4 w_t5
{err}too many variables specified
{txt}{search r(103):r(103);}

end of do-file

{search r(103):r(103);}

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. lgraph mktrf fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf c.fomc_d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.17
{txt}       Model {c |} {res} .126667827         1  .126667827   {txt}Prob > F        ={res}    0.6807
{txt}    Residual {c |} {res} 563.622236       754  .747509597   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0011
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}fomc_d {c |}{col 14}{res}{space 2}   -0.001{col 26}{space 2}    0.003{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}   -0.008{col 67}{space 3}    0.005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.054{col 26}{space 2}    0.057{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}   -0.057{col 67}{space 3}    0.166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. lgraph mktrf fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. drop if missing(w_t0)
{txt}(0 observations deleted)

{com}. 
. reg mktrf w_even

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.59
{txt}       Model {c |} {res} .439647514         1  .439647514   {txt}Prob > F        ={res}    0.4432
{txt}    Residual {c |} {res} 563.309257       754  .747094505   {txt}R-squared       ={res}    0.0008
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0005
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}w_even {c |}{col 14}{res}{space 2}    0.048{col 26}{space 2}    0.063{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}   -0.075{col 67}{space 3}    0.172
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.009{col 26}{space 2}    0.046{col 37}{space 1}    0.20{col 46}{space 3}0.842{col 54}{space 4}   -0.081{col 67}{space 3}    0.100
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. // Drop rows with missing S&P500 values (holidays, weekends)
. drop if missing(mktrf)
{txt}(59 observations deleted)

{com}. 
. drop if missing(w_t0)
{txt}(0 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. drop if missing(w_t0)
{txt}(0 observations deleted)

{com}. 
. reg mktrf w_even

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.59
{txt}       Model {c |} {res} .439647514         1  .439647514   {txt}Prob > F        ={res}    0.4432
{txt}    Residual {c |} {res} 563.309257       754  .747094505   {txt}R-squared       ={res}    0.0008
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0005
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}w_even {c |}{col 14}{res}{space 2}    0.048{col 26}{space 2}    0.063{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}   -0.075{col 67}{space 3}    0.172
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.009{col 26}{space 2}    0.046{col 37}{space 1}    0.20{col 46}{space 3}0.842{col 54}{space 4}   -0.081{col 67}{space 3}    0.100
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. drop if missing(w_t0)
{txt}(0 observations deleted)

{com}. 
. gen w_odd=0
{txt}
{com}. replace w_odd=1 if w_even==0
{txt}(352 real changes made)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. replace w_odd=1 if w_even==0
{txt}(0 real changes made)

{com}. 
. reg mktrf w_odd

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.59
{txt}       Model {c |} {res} .439647514         1  .439647514   {txt}Prob > F        ={res}    0.4432
{txt}    Residual {c |} {res} 563.309257       754  .747094505   {txt}R-squared       ={res}    0.0008
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0005
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}w_odd {c |}{col 14}{res}{space 2}   -0.048{col 26}{space 2}    0.063{col 37}{space 1}   -0.77{col 46}{space 3}0.443{col 54}{space 4}   -0.172{col 67}{space 3}    0.075
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.058{col 26}{space 2}    0.043{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}   -0.027{col 67}{space 3}    0.142
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf w_odd

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.59
{txt}       Model {c |} {res} .439647514         1  .439647514   {txt}Prob > F        ={res}    0.4432
{txt}    Residual {c |} {res} 563.309257       754  .747094505   {txt}R-squared       ={res}    0.0008
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0005
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}w_odd {c |}{col 14}{res}{space 2}   -0.048{col 26}{space 2}    0.063{col 37}{space 1}   -0.77{col 46}{space 3}0.443{col 54}{space 4}   -0.172{col 67}{space 3}    0.075
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.058{col 26}{space 2}    0.043{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}   -0.027{col 67}{space 3}    0.142
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg mktrf w_even

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.59
{txt}       Model {c |} {res} .439647514         1  .439647514   {txt}Prob > F        ={res}    0.4432
{txt}    Residual {c |} {res} 563.309257       754  .747094505   {txt}R-squared       ={res}    0.0008
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0005
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}w_even {c |}{col 14}{res}{space 2}    0.048{col 26}{space 2}    0.063{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}   -0.075{col 67}{space 3}    0.172
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.009{col 26}{space 2}    0.046{col 37}{space 1}    0.20{col 46}{space 3}0.842{col 54}{space 4}   -0.081{col 67}{space 3}    0.100
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. reg mktrf w_odd

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.59
{txt}       Model {c |} {res} .439647514         1  .439647514   {txt}Prob > F        ={res}    0.4432
{txt}    Residual {c |} {res} 563.309257       754  .747094505   {txt}R-squared       ={res}    0.0008
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0005
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}w_odd {c |}{col 14}{res}{space 2}   -0.048{col 26}{space 2}    0.063{col 37}{space 1}   -0.77{col 46}{space 3}0.443{col 54}{space 4}   -0.172{col 67}{space 3}    0.075
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.058{col 26}{space 2}    0.043{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}   -0.027{col 67}{space 3}    0.142
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg mktrf w_even w_odd
{txt}note: w_odd omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(1, 754)       = {res}     0.59
{txt}       Model {c |} {res} .439647514         1  .439647514   {txt}Prob > F        ={res}    0.4432
{txt}    Residual {c |} {res} 563.309257       754  .747094505   {txt}R-squared       ={res}    0.0008
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0005
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}w_even {c |}{col 14}{res}{space 2}    0.048{col 26}{space 2}    0.063{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}   -0.075{col 67}{space 3}    0.172
{txt}{space 7}w_odd {c |}{col 14}{res}{space 2}    0.000{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2}    0.009{col 26}{space 2}    0.046{col 37}{space 1}    0.20{col 46}{space 3}0.842{col 54}{space 4}   -0.081{col 67}{space 3}    0.100
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. replace w_odd=1 if w_even==0
{txt}(0 real changes made)

{com}. 
. 
. mean(mktrf) if w_even==0
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       352

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}mktrf {c |}{col 14}{res}{space 2}    0.009{col 26}{space 2}    0.047{col 37}{space 5}   -0.082{col 51}{space 3}    0.101
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. mean(mktrf) if w_even==0
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       352

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}mktrf {c |}{col 14}{res}{space 2}    0.009{col 26}{space 2}    0.047{col 37}{space 5}   -0.082{col 51}{space 3}    0.101
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean(mktrf) if w_even==1
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       404

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}mktrf {c |}{col 14}{res}{space 2}    0.058{col 26}{space 2}    0.043{col 37}{space 5}   -0.026{col 51}{space 3}    0.141
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD68481.000000"
{txt}
{com}. mean(mktrf) if w_even==1
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       404

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}mktrf {c |}{col 14}{res}{space 2}    0.058{col 26}{space 2}    0.043{col 37}{space 5}   -0.026{col 51}{space 3}    0.141
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. reg mktrf date2 w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       756
{txt}{hline 13}{c +}{hline 34}   F(3, 752)       = {res}     0.29
{txt}       Model {c |} {res} .640606074         3  .213535358   {txt}Prob > F        ={res}    0.8361
{txt}    Residual {c |} {res} 563.108298       752  .748814226   {txt}R-squared       ={res}    0.0011
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0028
{txt}       Total {c |} {res} 563.748904       755   .74668729   {txt}Root MSE        =   {res} .86534

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       mktrf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}date2 {c |}{col 14}{res}{space 2}    0.000{col 26}{space 2}    0.000{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4}   -0.000{col 67}{space 3}    0.000
{txt}{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.078{col 26}{space 2}    0.090{col 37}{space 1}    0.87{col 46}{space 3}0.385{col 54}{space 4}   -0.099{col 67}{space 3}    0.255
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.035{col 26}{space 2}    0.069{col 37}{space 1}    0.50{col 46}{space 3}0.614{col 54}{space 4}   -0.101{col 67}{space 3}    0.171
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   -0.473{col 26}{space 2}    2.019{col 37}{space 1}   -0.23{col 46}{space 3}0.815{col 54}{space 4}   -4.436{col 67}{space 3}    3.491
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. 