{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felixreichel/Documents/UNI/WIWI_Bachelor/2023S/SE Bachelorarbeit/Git/Partial Replication Cieslak 2019 et. al./stata_fed_put/stata_fed_put.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Jun 2023, 16:46:34
{txt}
{com}. 
. // Load FOMC cycle dummies .csv
. import delimited "fomc_week_dummies_2010_2016.csv", clear
{res}{text}(14 vars, 1800 obs)

{com}. // Order master data by date
. sort date
{txt}
{com}. // save .dta
. save d:fomc_data, replace
{txt}file d:fomc_data.dta saved

{com}. 
. 
. // Load SP500 data .csv
. //import delimited "sp500_df_2014_2016.csv", clear
. // Order data by date
. //sort date
. // save .dta
. //save d:us_returns_data, replace
. 
. // Load SP500 data .csv
. import delimited "us_returns_df_2010_2016.csv", clear
{res}{text}(8 vars, 1748 obs)

{com}. // Order data by date
. sort date
{txt}
{com}. // save .dta
. save d:us_returns_data, replace
{txt}file d:us_returns_data.dta saved

{com}. 
. merge date using d:fomc_data d:us_returns_data
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. // Save new merged data .dta
. save d:fed_put_datamerged_data, replace
{txt}file d:fed_put_datamerged_data.dta saved

{com}. 
. // Generate date2
. gen date2 = date(date, "YMD")
{txt}
{com}. 
. // Drop rows with missing S&P500 values (holidays, weekends)
. drop if missing(sp500)
{err}sp500 not found
{txt}{search r(111):r(111);}

end of do-file

{search r(111):r(111);}

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD75007.000000"
{txt}
{com}. reg mktrfmult i.w_t0 i.w_t2 i.w_t4 i.w_t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,719
{txt}{hline 13}{c +}{hline 34}   F(4, 1714)      = {res}     1.29
{txt}       Model {c |} {res} .000502826         4  .000125706   {txt}Prob > F        ={res}    0.2699
{txt}    Residual {c |} {res} .166427134     1,714  .000097099   {txt}R-squared       ={res}    0.0030
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0007
{txt}       Total {c |} {res}  .16692996     1,718  .000097165   {txt}Root MSE        =   {res} .00985

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mktrfmult{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}1.w_t0 {c |}{col 14}{res}{space 2}   -0.000{col 26}{space 2}    0.001{col 37}{space 1}   -0.44{col 46}{space 3}0.659{col 54}{space 4}   -0.002{col 67}{space 3}    0.001
{txt}{space 6}1.w_t2 {c |}{col 14}{res}{space 2}    0.000{col 26}{space 2}    0.001{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4}   -0.001{col 67}{space 3}    0.002
{txt}{space 6}1.w_t4 {c |}{col 14}{res}{space 2}    0.001{col 26}{space 2}    0.001{col 37}{space 1}    0.74{col 46}{space 3}0.459{col 54}{space 4}   -0.001{col 67}{space 3}    0.002
{txt}{space 6}1.w_t6 {c |}{col 14}{res}{space 2}   -0.002{col 26}{space 2}    0.001{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}   -0.004{col 67}{space 3}    0.000
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    1.001{col 26}{space 2}    0.000{col 37}{space 1} 2877.45{col 46}{space 3}0.000{col 54}{space 4}    1.000{col 67}{space 3}    1.001
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. mean(mktrf) if w_even==0
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       803

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}mktrf {c |}{col 14}{res}{space 2}    0.059{col 26}{space 2}    0.034{col 37}{space 5}   -0.007{col 51}{space 3}    0.126
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean(mktrf) if w_even==1
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       916

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}mktrf {c |}{col 14}{res}{space 2}    0.051{col 26}{space 2}    0.033{col 37}{space 5}   -0.015{col 51}{space 3}    0.116
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD75007.000000"
{txt}
{com}. reg mktrfmult i.w_t0 i.w_t2 i.w_t4 i.w_t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,719
{txt}{hline 13}{c +}{hline 34}   F(4, 1714)      = {res}     1.29
{txt}       Model {c |} {res} .000502826         4  .000125706   {txt}Prob > F        ={res}    0.2699
{txt}    Residual {c |} {res} .166427134     1,714  .000097099   {txt}R-squared       ={res}    0.0030
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0007
{txt}       Total {c |} {res}  .16692996     1,718  .000097165   {txt}Root MSE        =   {res} .00985

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mktrfmult{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}1.w_t0 {c |}{col 14}{res}{space 2}   -0.000{col 26}{space 2}    0.001{col 37}{space 1}   -0.44{col 46}{space 3}0.659{col 54}{space 4}   -0.002{col 67}{space 3}    0.001
{txt}{space 6}1.w_t2 {c |}{col 14}{res}{space 2}    0.000{col 26}{space 2}    0.001{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4}   -0.001{col 67}{space 3}    0.002
{txt}{space 6}1.w_t4 {c |}{col 14}{res}{space 2}    0.001{col 26}{space 2}    0.001{col 37}{space 1}    0.74{col 46}{space 3}0.459{col 54}{space 4}   -0.001{col 67}{space 3}    0.002
{txt}{space 6}1.w_t6 {c |}{col 14}{res}{space 2}   -0.002{col 26}{space 2}    0.001{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}   -0.004{col 67}{space 3}    0.000
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    1.001{col 26}{space 2}    0.000{col 37}{space 1} 2877.45{col 46}{space 3}0.000{col 54}{space 4}    1.000{col 67}{space 3}    1.001
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. mean(rf) if w_even==0
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       803

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 10}rf {c |}{col 14}{res}{space 2}    0.242{col 26}{space 2}    0.015{col 37}{space 5}    0.212{col 51}{space 3}    0.271
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean(rf) if w_even==1
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       916

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 10}rf {c |}{col 14}{res}{space 2}    0.239{col 26}{space 2}    0.014{col 37}{space 5}    0.211{col 51}{space 3}    0.267
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD75007.000000"
{txt}
{com}. reg mktrfmult i.w_t0 i.w_t2 i.w_t4 i.w_t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,719
{txt}{hline 13}{c +}{hline 34}   F(4, 1714)      = {res}     1.29
{txt}       Model {c |} {res} .000502826         4  .000125706   {txt}Prob > F        ={res}    0.2699
{txt}    Residual {c |} {res} .166427134     1,714  .000097099   {txt}R-squared       ={res}    0.0030
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0007
{txt}       Total {c |} {res}  .16692996     1,718  .000097165   {txt}Root MSE        =   {res} .00985

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mktrfmult{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}1.w_t0 {c |}{col 14}{res}{space 2}   -0.000{col 26}{space 2}    0.001{col 37}{space 1}   -0.44{col 46}{space 3}0.659{col 54}{space 4}   -0.002{col 67}{space 3}    0.001
{txt}{space 6}1.w_t2 {c |}{col 14}{res}{space 2}    0.000{col 26}{space 2}    0.001{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4}   -0.001{col 67}{space 3}    0.002
{txt}{space 6}1.w_t4 {c |}{col 14}{res}{space 2}    0.001{col 26}{space 2}    0.001{col 37}{space 1}    0.74{col 46}{space 3}0.459{col 54}{space 4}   -0.001{col 67}{space 3}    0.002
{txt}{space 6}1.w_t6 {c |}{col 14}{res}{space 2}   -0.002{col 26}{space 2}    0.001{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}   -0.004{col 67}{space 3}    0.000
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    1.001{col 26}{space 2}    0.000{col 37}{space 1} 2877.45{col 46}{space 3}0.000{col 54}{space 4}    1.000{col 67}{space 3}    1.001
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. mean(sml) if w_even==0
{err}variable {bf}sml{sf} not found
{txt}{search r(111):r(111);}

end of do-file

{search r(111):r(111);}

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD75007.000000"
{txt}
{com}. reg mktrfmult i.w_t0 i.w_t2 i.w_t4 i.w_t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,719
{txt}{hline 13}{c +}{hline 34}   F(4, 1714)      = {res}     1.29
{txt}       Model {c |} {res} .000502826         4  .000125706   {txt}Prob > F        ={res}    0.2699
{txt}    Residual {c |} {res} .166427134     1,714  .000097099   {txt}R-squared       ={res}    0.0030
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0007
{txt}       Total {c |} {res}  .16692996     1,718  .000097165   {txt}Root MSE        =   {res} .00985

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mktrfmult{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}1.w_t0 {c |}{col 14}{res}{space 2}   -0.000{col 26}{space 2}    0.001{col 37}{space 1}   -0.44{col 46}{space 3}0.659{col 54}{space 4}   -0.002{col 67}{space 3}    0.001
{txt}{space 6}1.w_t2 {c |}{col 14}{res}{space 2}    0.000{col 26}{space 2}    0.001{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4}   -0.001{col 67}{space 3}    0.002
{txt}{space 6}1.w_t4 {c |}{col 14}{res}{space 2}    0.001{col 26}{space 2}    0.001{col 37}{space 1}    0.74{col 46}{space 3}0.459{col 54}{space 4}   -0.001{col 67}{space 3}    0.002
{txt}{space 6}1.w_t6 {c |}{col 14}{res}{space 2}   -0.002{col 26}{space 2}    0.001{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}   -0.004{col 67}{space 3}    0.000
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    1.001{col 26}{space 2}    0.000{col 37}{space 1} 2877.45{col 46}{space 3}0.000{col 54}{space 4}    1.000{col 67}{space 3}    1.001
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. mean(smb) if w_even==0
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       803

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}smb {c |}{col 14}{res}{space 2}   -0.010{col 26}{space 2}    0.018{col 37}{space 5}   -0.046{col 51}{space 3}    0.025
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean(smb) if w_even==1
{res}
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       916

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. Err.{col 38}     [95% Con{col 51}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}smb {c |}{col 14}{res}{space 2}    0.017{col 26}{space 2}    0.018{col 37}{space 5}   -0.017{col 51}{space 3}    0.052
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
{txt}end of do-file

{com}. 