{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felixreichel/Documents/UNI/WIWI_Bachelor/2023S/SE Bachelorarbeit/Git/Partial Replication Cieslak 2019 et. al./stata_fed_put/stata_fed_put.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Jun 2023, 17:08:06
{txt}
{com}. 
. // Load FOMC cycle dummies .csv
. //import delimited "fomc_week_dummies_2010_2016.csv", clear
. import delimited "fomc_week_dummies_2014_2016.csv", clear
{res}{text}(13 vars, 814 obs)

{com}. // Order master data by date
. sort date
{txt}
{com}. // save .dta
. save d:fomc_data, replace
{txt}file d:fomc_data.dta saved

{com}. 
. 
. // Load SP500 data .csv
. //import delimited "sp500_df_2014_2016.csv", clear
. // Order data by date
. //sort date
. // save .dta
. //save d:sp500_data, replace
. 
. // Load us_returns_df_2010_2016.csv
. import delimited "us_returns_df_2010_2016.csv", clear
{res}{text}(5 vars, 1748 obs)

{com}. // Order data by date
. sort date
{txt}
{com}. // save .dta
. save d:us_returns_data, replace
{txt}file d:us_returns_data.dta saved

{com}. 
. merge date using d:fomc_data d:us_returns_data d:sp500_data
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. // Save new merged data .dta
. save d:fed_put_datamerged_data, replace
{txt}file d:fed_put_datamerged_data.dta saved

{com}. 
. // Generate date2
. gen date2 = date(date, "YMD")
{txt}
{com}. 
. // For 2014 to 2016
. 
. drop if date2 <= 19723
{txt}(993 observations deleted)

{com}. 
. // Cieslak replication File excess returns
. 
. * Stock and bill return variables
. * -------------------------------
. 
. //Expected Return = Risk-free rate + (Beta*Market risk premium)
. 
. //                             = Rf + β(Rm – Rf)
. 
. 
. //Excess return = Total return – Expected return
. 
. //Applying the expected return formula to the above:
. 
.  //                      = Tr – Rf + β(Rm – Rf)
. 
. 
. ge m=(mktrf+rf)/100+1
{txt}(43 missing values generated)

{com}. ge r=rf/100+1
{txt}(43 missing values generated)

{com}. replace m=1 if m==. 
{txt}(43 real changes made)

{com}. replace r=1 if r==. 
{txt}(43 real changes made)

{com}. ge lnm=ln(m)
{txt}
{com}. ge lnr=ln(r)
{txt}
{com}. 
. label variable m "1+stock return"
{txt}
{com}. label variable r "1+bill return"
{txt}
{com}. label variable lnm "ln(1+stock return)"
{txt}
{com}. label variable lnr "ln(1+bill return)"
{txt}
{com}. 
. //so year month day
. ge ex1=100*(m-r)
{txt}
{com}. ge ex5=100*(m*m[_n+1]*m[_n+2]*m[_n+3]*m[_n+4]-r*r[_n+1]*r[_n+2]*r[_n+3]*r[_n+4] )
{txt}(4 missing values generated)

{com}. label variable ex1 "1-day excess return, day t, pct"
{txt}
{com}. label variable ex5 "5-day excess return, day t to t+4 pct"
{txt}
{com}. 
. ge t=_n
{txt}
{com}. label variable t "Observation number"
{txt}
{com}. 
. 
. // ------
. 
. 
. 
. 
. 
. 
. drop if t > 783
{txt}(16 observations deleted)

{com}. 
. // drop if missing(mktrf)
. 
. 
. // 777 observations vs. 783 (6 diff) because of "drop for missing dummies" (-6 obs.)
. 
. lgraph ex5 fomc_d
{res}{txt}
{com}. 
. 
. 
. // MLR
. 
. 
. 
. 
. 
. reg ex1 w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       782
{txt}{hline 13}{c +}{hline 34}   F(2, 779)       = {res}     3.92
{txt}       Model {c |} {res} 5.55579666         2  2.77789833   {txt}Prob > F        ={res}    0.0202
{txt}    Residual {c |} {res} 552.036171       779  .708647202   {txt}R-squared       ={res}    0.0100
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0074
{txt}       Total {c |} {res} 557.591967       781  .713946181   {txt}Root MSE        =   {res} .84181

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ex1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.174{col 26}{space 2}    0.087{col 37}{space 1}    1.99{col 46}{space 3}0.046{col 54}{space 4}    0.003{col 67}{space 3}    0.345
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.166{col 26}{space 2}    0.068{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4}    0.034{col 67}{space 3}    0.299
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   -0.049{col 26}{space 2}    0.041{col 37}{space 1}   -1.18{col 46}{space 3}0.240{col 54}{space 4}   -0.130{col 67}{space 3}    0.033
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. // edit if !e(sample)
. replace fomc_d = 29 in 440
{txt}(1 real change made)

{com}. replace w_t0 = 0 in 440
{txt}(1 real change made)

{com}. 
. replace w_t2t4t6 = 1 in 440
{txt}(1 real change made)

{com}. replace w_even = 1 in 440
{txt}(1 real change made)

{com}. 
. replace w_t1 = 0 in 440
{txt}(1 real change made)

{com}. replace w_t2 = 0 in 440
{txt}(1 real change made)

{com}. replace w_t3 = 0 in 440
{txt}(1 real change made)

{com}. replace w_t4 = 0 in 440
{txt}(1 real change made)

{com}. replace w_t5 = 0 in 440
{txt}(1 real change made)

{com}. replace w_t6 = 1 in 440
{txt}(1 real change made)

{com}. replace w_tm1 = 0 in 440
{txt}(1 real change made)

{com}. 
. reg ex1 w_t0 w_t2t4t6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       783
{txt}{hline 13}{c +}{hline 34}   F(2, 780)       = {res}     4.19
{txt}       Model {c |} {res} 5.99711699         2  2.99855849   {txt}Prob > F        ={res}    0.0154
{txt}    Residual {c |} {res} 557.783789       780  .715107421   {txt}R-squared       ={res}    0.0106
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0081
{txt}       Total {c |} {res} 563.780906       782   .72094745   {txt}Root MSE        =   {res} .84564

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ex1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.174{col 26}{space 2}    0.088{col 37}{space 1}    1.99{col 46}{space 3}0.047{col 54}{space 4}    0.002{col 67}{space 3}    0.346
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.176{col 26}{space 2}    0.068{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4}    0.043{col 67}{space 3}    0.309
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   -0.049{col 26}{space 2}    0.042{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}   -0.130{col 67}{space 3}    0.033
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg ex1 w_tm1 w_t1 w_t3 w_t5

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       783
{txt}{hline 13}{c +}{hline 34}   F(4, 778)       = {res}     2.36
{txt}       Model {c |} {res} 6.76103294         4  1.69025823   {txt}Prob > F        ={res}    0.0519
{txt}    Residual {c |} {res} 557.019873       778  .715963847   {txt}R-squared       ={res}    0.0120
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0069
{txt}       Total {c |} {res} 563.780906       782   .72094745   {txt}Root MSE        =   {res} .84615

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         ex1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}w_tm1 {c |}{col 14}{res}{space 2}   -0.200{col 26}{space 2}    0.089{col 37}{space 1}   -2.25{col 46}{space 3}0.025{col 54}{space 4}   -0.375{col 67}{space 3}   -0.025
{txt}{space 8}w_t1 {c |}{col 14}{res}{space 2}   -0.180{col 26}{space 2}    0.089{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4}   -0.355{col 67}{space 3}   -0.005
{txt}{space 8}w_t3 {c |}{col 14}{res}{space 2}   -0.195{col 26}{space 2}    0.089{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}   -0.370{col 67}{space 3}   -0.021
{txt}{space 8}w_t5 {c |}{col 14}{res}{space 2}   -0.067{col 26}{space 2}    0.122{col 37}{space 1}   -0.55{col 46}{space 3}0.581{col 54}{space 4}   -0.308{col 67}{space 3}    0.173
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}    0.127{col 26}{space 2}    0.044{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4}    0.040{col 67}{space 3}    0.213
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg ex1 w_t0 w_t2 w_t4, robust

{txt}Linear regression                               Number of obs     = {res}       783
                                                {txt}F(3, 779)         =  {res}     2.70
                                                {txt}Prob > F          = {res}    0.0447
                                                {txt}R-squared         = {res}    0.0101
                                                {txt}Root MSE          =    {res} .84642

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ex1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.169{col 26}{space 2}    0.091{col 37}{space 1}    1.86{col 46}{space 3}0.063{col 54}{space 4}   -0.009{col 67}{space 3}    0.348
{txt}{space 8}w_t2 {c |}{col 14}{res}{space 2}    0.141{col 26}{space 2}    0.080{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}   -0.016{col 67}{space 3}    0.299
{txt}{space 8}w_t4 {c |}{col 14}{res}{space 2}    0.195{col 26}{space 2}    0.083{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4}    0.032{col 67}{space 3}    0.358
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   -0.044{col 26}{space 2}    0.043{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}   -0.128{col 67}{space 3}    0.040
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg ex1 w_t0 w_t2t4t6, robust

{txt}Linear regression                               Number of obs     = {res}       783
                                                {txt}F(2, 780)         =  {res}     4.24
                                                {txt}Prob > F          = {res}    0.0147
                                                {txt}R-squared         = {res}    0.0106
                                                {txt}Root MSE          =    {res} .84564

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ex1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}w_t0 {c |}{col 14}{res}{space 2}    0.174{col 26}{space 2}    0.091{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}   -0.004{col 67}{space 3}    0.352
{txt}{space 4}w_t2t4t6 {c |}{col 14}{res}{space 2}    0.176{col 26}{space 2}    0.066{col 37}{space 1}    2.67{col 46}{space 3}0.008{col 54}{space 4}    0.047{col 67}{space 3}    0.305
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   -0.049{col 26}{space 2}    0.043{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}   -0.132{col 67}{space 3}    0.035
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. 