{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felixreichel/Documents/UNI/WIWI_Bachelor/2023S/SE Bachelorarbeit/Git/Partial Replication Cieslak 2019 et. al./stata_fed_put/stata_fed_put.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Jun 2023, 01:01:19
{txt}
{com}. 
. // Load FOMC cycle dummies .csv
. import delimited "fomc_week_dummies_2010_2016.csv", clear
{res}{text}(12 vars, 1779 obs)

{com}. // Order master data by date
. sort date
{txt}
{com}. // save .dta
. save d:fomc_data, replace
{txt}file d:fomc_data.dta saved

{com}. 
. 
. // Load SP500 data .csv
. import delimited "sp500_df_2014_2016.csv", clear
{res}{text}(2 vars, 756 obs)

{com}. // Order data by date
. sort date
{txt}
{com}. // save .dta
. save d:sp500_data, replace
{txt}file d:sp500_data.dta saved

{com}. 
. // Load SP500 data .csv
. import delimited "us_returns_df_2010_2016.csv", clear
{res}{text}(6 vars, 1810 obs)

{com}. // Order data by date
. sort date
{txt}
{com}. // save .dta
. save d:us_returns_data, replace
{txt}file d:us_returns_data.dta saved

{com}. 
. merge date using d:fomc_data d:us_returns_data d:sp500_data
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. // Save new merged data .dta
. save d:fed_put_datamerged_data, replace
{txt}file d:fed_put_datamerged_data.dta saved

{com}. 
. // Generate date2
. gen date2 = date(date, "YMD")
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hf/g0s_93555pz7fv66ncnr3v7r0000gn/T//SD83499.000000"
{txt}
{com}. //drop if date2 <= 19723
. 
. 
. lgraph mktrfavg5d fomc_d
{res}{txt}
{com}. 
{txt}end of do-file

{com}. 